tocache/Microchip-PIC18F4550/UPC Microcontroladores 2019-2/Semana 9/myfirstc.X/niucode5.c
/*Este es un comentario*/
//Mi primer programa en XC8

//Declaracion de los bits de configuracion

#pragma config PLLDIV = 1       // PLL Prescaler Selection bits (No prescale (4 MHz oscillator input drives PLL directly))
#pragma config CPUDIV = OSC1_PLL2// System Clock Postscaler Selection bits ([Primary Oscillator Src: /1][96 MHz PLL Src: /2])
#pragma config FOSC = XTPLL_XT  // Oscillator Selection bits (XT oscillator, PLL enabled (XTPLL))

#pragma config PWRT = ON        // Power-up Timer Enable bit (PWRT enabled)
#pragma config BOR = OFF        // Brown-out Reset Enable bits (Brown-out Reset disabled in hardware and software)
#pragma config BORV = 3         // Brown-out Reset Voltage bits (Minimum setting 2.05V)
#pragma config WDT = OFF        // Watchdog Timer Enable bit (WDT disabled (control is placed on the SWDTEN bit))
#pragma config WDTPS = 32768    // Watchdog Timer Postscale Select bits (1:32768)
#pragma config CCP2MX = ON      // CCP2 MUX bit (CCP2 input/output is multiplexed with RC1)
#pragma config PBADEN = OFF     // PORTB A/D Enable bit (PORTB<4:0> pins are configured as digital I/O on Reset)
#pragma config MCLRE = ON       // MCLR Pin Enable bit (MCLR pin enabled; RE3 input pin disabled)
#pragma config LVP = OFF        // Single-Supply ICSP Enable bit (Single-Supply ICSP disabled)

#include <xc.h>
#define _XTAL_FREQ 48000000

unsigned char ajicon[] = {0x01, 0x02, 0x04, 0x08, 0x10, 0x20, 0x40, 0x80, 0x40, 0x20, 0x10, 0x08, 0x04, 0x02};
unsigned char rocotocon[] = {0x81, 0x42, 0x24, 0x18, 0x24, 0x42};
unsigned int tiempo = 0;
unsigned int camote = 0;

int retardon(tiempo){
    for (int i=0; i<tiempo; i++){
        __delay_ms(1);
    }
}

int visual(void){
        if(PORTEbits.RE0 == 1){
        for (int papa=0; papa<14; papa++){
            LATD = ajicon[papa];
            //__delay_ms(100);
            retardon(camote);
        }
    }
    else{
        for (int papa=0; papa<5; papa++){
            LATD = rocotocon[papa];
            //__delay_ms(100);
            retardon(camote);                
        }
    }
}

void main(void){
    TRISD = 0x00;
    ADCON1 = 0x0F;      //Para que RE0 sea digital
    while(1){
        switch(PORTB & 0x03){
            case 0 :
                camote = 50;
                break;
            case 1 :
                camote = 100;
                break;
            case 2 :
                camote = 150;
                break;
            case 3 :
                camote = 200;
                break;
        }
        visual();
    }
}